In [69]:
import numpy as np
import pandas as pd

# Series/Seriler

In [70]:
benimsozlugum={"Gokce":25, "Zeynep":40, "Mehmet":30}

In [71]:
pd.Series(benimsozlugum)

Gokce     25
Zeynep    40
Mehmet    30
dtype: int64

In [72]:
benmlistem=[25,40,30]
benimisismlerim=["Gokce", "Zeynep", "Mehmet"]

In [73]:
benimyaslarım =[25,40,30]
benimisimlerim=["Gokce", "Zeynep", "Mehmet"]

In [74]:
pd.Series(benimyaslarım)

0    25
1    40
2    30
dtype: int64

In [75]:
pd.Series(benimyaslarım,benimisimlerim)

Gokce     25
Zeynep    40
Mehmet    30
dtype: int64

In [76]:
pd.Series(data=benimyaslarım, index=benimisimlerim)

Gokce     25
Zeynep    40
Mehmet    30
dtype: int64

In [77]:
numpydizisi=np.array([25,40,30])

In [78]:
numpydizisi

array([25, 40, 30])

In [79]:
pd.Series(numpydizisi)

0    25
1    40
2    30
dtype: int32

In [80]:
pd.Series(numpydizisi,benimisimlerim)

Gokce     25
Zeynep    40
Mehmet    30
dtype: int32

In [81]:
pd.Series(["Gokce","Atlas","Osman"],[1,2,3])

1    Gokce
2    Atlas
3    Osman
dtype: object

In [82]:
yarismasonucu1=pd.Series([10,5,1],["Gokce","Atlas","Osman"])

In [83]:
yarismasonucu1

Gokce    10
Atlas     5
Osman     1
dtype: int64

In [84]:
yarismasonucu2=pd.Series([20,10,8],["Gokce","Atlas","Osman"])

In [85]:
yarismasonucu2

Gokce    20
Atlas    10
Osman     8
dtype: int64

In [86]:
yarismasonucu2["Gokce"]

20

In [87]:
sonsonuc=yarismasonucu1+yarismasonucu2

In [88]:
sonsonuc

Gokce    30
Atlas    15
Osman     9
dtype: int64

In [89]:
farkliseries1=pd.Series([20,30,40,50],["a","b","c","d"])

In [90]:
farkliseries2=pd.Series([10,5,3,1],["a","c","f","g"])

In [91]:
farkliseries1

a    20
b    30
c    40
d    50
dtype: int64

In [92]:
farkliseries2

a    10
c     5
f     3
g     1
dtype: int64

# DataFrame

In [93]:
np.random.randn(4,3)

array([[-0.88628342,  0.46578109, -0.91258958],
       [ 0.84197846,  1.06907982,  1.27727066],
       [-0.01997558,  0.99524132,  0.7172824 ],
       [ 0.07171084,  1.10001651, -1.87500342]])

In [94]:
data=np.random.randn(4,3)

In [95]:
dataframe=pd.DataFrame(data)

In [96]:
dataframe

          0         1         2
0  0.011472  0.507966  0.382866
1 -2.551795  0.737823 -1.576855
2  0.606285  1.037011 -0.291025
3  0.552058 -0.071899  0.704680

In [97]:
dataframe[0]

0    0.011472
1   -2.551795
2    0.606285
3    0.552058
Name: 0, dtype: float64

In [98]:
type(dataframe)

pandas.core.frame.DataFrame

In [99]:
type(dataframe[0])

pandas.core.series.Series

In [100]:
yenidataframe=pd.DataFrame(data,index=["Gokce","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","calisma saati"])

In [101]:
yenidataframe

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025
Mehmet  0.552058 -0.071899       0.704680

In [102]:
yenidataframe["Yas"]

Gokce     0.507966
Zeynep    0.737823
Atlas     1.037011
Mehmet   -0.071899
Name: Yas, dtype: float64

In [103]:
yenidataframe[["Maas","Yas"]]

            Maas       Yas
Gokce   0.011472  0.507966
Zeynep -2.551795  0.737823
Atlas   0.606285  1.037011
Mehmet  0.552058 -0.071899

In [104]:
yenidataframe.loc["Gokce"]

Maas             0.011472
Yas              0.507966
calisma saati    0.382866
Name: Gokce, dtype: float64

In [105]:
yenidtaframe.loc["Zeynep"]

Maas            -1.245603
Yas             -0.815546
calisma saati   -0.513180
Name: Zeynep, dtype: float64

In [106]:
yenidataframe.iloc[1]

Maas            -2.551795
Yas              0.737823
calisma saati   -1.576855
Name: Zeynep, dtype: float64

In [108]:
yenidataframe

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025
Mehmet  0.552058 -0.071899       0.704680

In [109]:
yenidataframe["Emeklilik yası"]=yenidataframe["Yas"]+yenidataframe["Yas"]

In [113]:
yenidataframe

            Maas       Yas  calisma saati  Emeklilik yası
Gokce   0.011472  0.507966       0.382866        1.015931
Zeynep -2.551795  0.737823      -1.576855        1.475646
Atlas   0.606285  1.037011      -0.291025        2.074023
Mehmet  0.552058 -0.071899       0.704680       -0.143797

In [115]:
yenidataframe.drop("Emeklilik yası", axis=1)

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025
Mehmet  0.552058 -0.071899       0.704680

In [116]:
yenidataframe.drop("Mehmet",axis=0)

            Maas       Yas  calisma saati  Emeklilik yası
Gokce   0.011472  0.507966       0.382866        1.015931
Zeynep -2.551795  0.737823      -1.576855        1.475646
Atlas   0.606285  1.037011      -0.291025        2.074023

In [118]:
yenidataframe.drop("Emeklilik yası", axis=1, inplace=True)

In [119]:
yenidataframe

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025
Mehmet  0.552058 -0.071899       0.704680

In [120]:
yenidataframe.loc["Gokce"]["Yas"]

0.5079657139622552

In [121]:
yenidataframe.loc["Atlas"]["Yas"]

1.0370113034764437

In [122]:
yenidataframe

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025
Mehmet  0.552058 -0.071899       0.704680

In [123]:
yenidataframe<0

         Maas    Yas  calisma saati
Gokce   False  False          False
Zeynep   True  False           True
Atlas   False  False           True
Mehmet  False   True          False

In [124]:
booleanframe=yenidataframe<0

In [125]:
booleanframe

         Maas    Yas  calisma saati
Gokce   False  False          False
Zeynep   True  False           True
Atlas   False  False           True
Mehmet  False   True          False

In [126]:
yenidataframe[booleanframe]

            Maas       Yas  calisma saati
Gokce        NaN       NaN            NaN
Zeynep -2.551795       NaN      -1.576855
Atlas        NaN       NaN      -0.291025
Mehmet       NaN -0.071899            NaN

In [127]:
yenidataframe[yenidataframe<0]

            Maas       Yas  calisma saati
Gokce        NaN       NaN            NaN
Zeynep -2.551795       NaN      -1.576855
Atlas        NaN       NaN      -0.291025
Mehmet       NaN -0.071899            NaN

In [128]:
yenidataframe[yenidataframe["Yas"]>0]

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Zeynep -2.551795  0.737823      -1.576855
Atlas   0.606285  1.037011      -0.291025

In [131]:
yenidataframe[yenidataframe["calisma saati"]>0]

            Maas       Yas  calisma saati
Gokce   0.011472  0.507966       0.382866
Mehmet  0.552058 -0.071899       0.704680

# İndex Değiştirme

In [132]:
yeniindexlistesi=["Gok","Zey","Ati","Meh"]

In [134]:
yenidataframe["Yeni Index"] = yeniindexlistesi

In [135]:
yenidataframe.set_index("Yeni Index")

                Maas       Yas  calisma saati
Yeni Index
Gok         0.011472  0.507966       0.382866
Zey        -2.551795  0.737823      -1.576855
Ati         0.606285  1.037011      -0.291025
Meh         0.552058 -0.071899       0.704680

In [136]:
yenidataframe

            Maas       Yas  calisma saati Yeni Index
Gokce   0.011472  0.507966       0.382866        Gok
Zeynep -2.551795  0.737823      -1.576855        Zey
Atlas   0.606285  1.037011      -0.291025        Ati
Mehmet  0.552058 -0.071899       0.704680        Meh

In [137]:
yenidataframe.set_index("Yeni Index",inplace=True)

In [138]:
yenidataframe

                Maas       Yas  calisma saati
Yeni Index
Gok         0.011472  0.507966       0.382866
Zey        -2.551795  0.737823      -1.576855
Ati         0.606285  1.037011      -0.291025
Meh         0.552058 -0.071899       0.704680

In [139]:
yenidataframe.loc["Gok"]

Maas             0.011472
Yas              0.507966
calisma saati    0.382866
Name: Gok, dtype: float64

# Multi Index

In [140]:
ilkindexler=["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [141]:
icindexler=["Homer","Bart","Marge","Cartman", "Kenny","Kyle"]

In [142]:
birlesmisindex=list(zip(ilkindexler,icindexler))

In [143]:
birlesmisindex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [148]:
birlesmisindex=pd.MultiIndex.from_tuples(birlesmisindex)

In [149]:
birlesmisindex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [150]:
benimcizgifilmlistem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [152]:
cizgifilmnumpydizisi=np.array(benimcizgifilmlistem)

In [154]:
cizgifilmdataframe=pd.DataFrame(cizgifilmnumpydizisi,index=birlesmisindex,columns=["Yas","Meslek"])

In [155]:
cizgifilmdataframe

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [156]:
cizgifilmdataframe.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [157]:
cizgifilmdataframe.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [158]:
cizgifilmdataframe

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [159]:
cizgifilmdataframe.index.names=["Film Adı","İsim"]

In [160]:
cizgifilmdataframe

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

# Eksik Veri

In [165]:
sozlukverisi={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]}
havadurumudataframe=pd.DataFrame(sozlukverisi)

In [166]:
havadurumudataframe

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [167]:
havadurumudataframe.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [168]:
havadurumudataframe.dropna(axis=1)

   izmir
0     40
1     39
2     38

In [172]:
yeniveri={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38],"antalya":[45,np.nan,np.nan]}
yenidataframe1=pd.DataFrame(yeniveri)

In [173]:
yenidataframe1

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [174]:
yenidataframe1.dropna(axis=1,thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [176]:
yenidataframe1.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# Groupby

In [180]:
maassozlugu={"Departman":["Yazılım","Satış","pazarlama","Finans","ik","Hukuk"],
            "Çalışan İsmi":["Ahmet","Mehmet","Gokce","Burak","Zeynep","Fatma"],
            "Maaş" :[100,150,200,300,400,500]}

In [184]:
maasdataframe=pd.DataFrame(maassozlugu)

In [185]:
maasdataframe

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1      Satış       Mehmet   150
2  pazarlama        Gokce   200
3     Finans        Burak   300
4         ik       Zeynep   400
5      Hukuk        Fatma   500

In [187]:
grupobjesi=maasdataframe.groupby("Departman")

In [188]:
grupobjesi.count()

           Çalışan İsmi  Maaş
Departman
Finans                1     1
Hukuk                 1     1
Satış                 1     1
Yazılım               1     1
ik                    1     1
pazarlama             1     1

In [189]:
grupobjesi.mean()

            Maaş
Departman
Finans     300.0
Hukuk      500.0
Satış      150.0
Yazılım    100.0
ik         400.0
pazarlama  200.0

In [190]:
grupobjesi.min()

          Çalışan İsmi  Maaş
Departman
Finans           Burak   300
Hukuk            Fatma   500
Satış           Mehmet   150
Yazılım          Ahmet   100
ik              Zeynep   400
pazarlama        Gokce   200

In [191]:
grupobjesi.max()

          Çalışan İsmi  Maaş
Departman
Finans           Burak   300
Hukuk            Fatma   500
Satış           Mehmet   150
Yazılım          Ahmet   100
ik              Zeynep   400
pazarlama        Gokce   200

# Concat

In [193]:
sozluk1={"İsim":["Ahmet","Mehmet","Atıl","Zeynep"],
        "Spor":["Koşu", "Yüzme", "Koşu","Basketbol"],
        "Kalori": [100,200,300,400]}

In [195]:
dataframe1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [196]:
dataframe1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2    Atıl       Koşu     300
3  Zeynep  Basketbol     400

In [197]:
sozluk2={"İsim":["Osman","Levent","Koray","Fatma"],
        "Spor":["Koşu", "Yüzme", "Koşu","Basketbol"],
        "Kalori": [200,100,50,300]}

In [198]:
dataframe2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [201]:
sozluk3={"İsim":["Ayse","Mahmut","Duygu","Nur"],
        "Spor":["Koşu", "Yüzme", "Badminton","Tenis"],
        "Kalori": [300,400,500,300]}

In [202]:
dataframe3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [203]:
dataframe2

     İsim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Koray       Koşu      50
7   Fatma  Basketbol     300

In [204]:
dataframe3

      İsim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     300

In [206]:
pd.concat([dataframe1,dataframe2,dataframe3],axis=0)

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2     Atıl       Koşu     300
3   Zeynep  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Koray       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     300

# Merge

In [214]:
mergesozluk1={"İsim":["Ahmet","Mehmet","Atıl","Zeynep"],
        "Spor":["Koşu", "Yüzme", "Koşu","Basketbol"]}

In [215]:
mergesozluk2={"İsim":["Ahmet","Mehmet","Atıl","Zeynep"],
        "Kalori":[100,200,150,250]}

In [227]:
mergedataframe2=pd.DataFrame(mergesozluk2)

In [228]:
mergedataframe1=pd.DataFrame(mergesozluk1)

In [229]:
mergedataframe1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2    Atıl       Koşu
3  Zeynep  Basketbol

In [230]:
mergedataframe2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2    Atıl     150
3  Zeynep     250

In [231]:
pd.merge(mergedataframe1,mergedataframe2,on="İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2    Atıl       Koşu     150
3  Zeynep  Basketbol     250

# İleri operasyonlar

In [232]:
maassozluk={"İsim":["Ahmet","Mehmet","Atıl","Zeynep"],
           "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
           "Maas":[200,300,400,500]}

In [233]:
maasdataframe=pd.DataFrame(maassozluk)

In [234]:
maasdataframe

     İsim  Departman  Maas
0   Ahmet    Yazılım   200
1  Mehmet      Satış   300
2    Atıl  Pazarlama   400
3  Zeynep    Yazılım   500

In [236]:
maasdataframe["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [240]:
maasdataframe["Departman"].nunique()

3

In [241]:
maasdataframe["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [243]:
def bruttenNete(maas):
    return maas*0.66

In [244]:
maasdataframe["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

# Piivot Table Oluşturma

In [245]:
yenibirveri={"karakter sınıfı":["South Park","South Park","Simpson","Simpson"],
            "Karakter Ismi":["Cartman","Kenny","Homer","Bart"],
            "Karakter Yas":[9,10,50,20]}

In [246]:
karakterdp=pd.DataFrame(yenibirveri)

In [247]:
karakterdp

  karakter sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [249]:
karakterdp.pivot_table(values="Karakter Yas", index=["karakter sınıfı","Karakter Ismi"])

                               Karakter Yas
karakter sınıfı Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

# Excel

In [ ]:
dataframe=pd.read_excel("Maas.xlsx")

In [ ]:
dataframe

In [ ]:
dataframe.to_excel("yenimaas.xlsx")

In [ ]:
##read_csv
##to_csv